<!-- dflook/terraform-github-actions {"workspace":"fix-self-hosted-2","backend_type":"remote","backend":"6045e85902ee848374c9b2dbe3c2c5b3a0f1d510ff9ce712f7b6a7ae3afb27e5","plan_job_ref":"Job Test Terraform cloud #202 at https://github.com/dflook/terraform-github-actions/actions/runs/7277293772","plan_hash":"b5644ef62dfddeca2cdb6d80ad20817def1d35660223331e9c13a36e9373c16a","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fix-self-hosted-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #202](https://github.com/dflook/terraform-github-actions/actions/runs/7277293772)